### Pandas DataFrame exersizes = https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
    }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.

In [15]:
df['score'].isnull().sum()

2

##### 36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [18]:
df_droplist = df.copy().drop(['c', 'd', 'e'], axis=0)
df_droplist

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

##### 37. Write a Pandas program to reset index in a given DataFrame.

In [29]:
df_reset = df.copy().reset_index()
# df_reset = df_reset.drop(['index'], axis=1).drop([0, 1, 2], axis=0)
# df_reset = df_reset.reset_index().drop(['index'], axis=1)
df_reset

  index       name  score  attempts qualify
0     a  Anastasia   12.5         1     yes
1     b       Dima    9.0         3      no
2     c  Katherine   16.5         2     yes
3     d      James    NaN         3      no
4     e      Emily    9.0         2      no
5     f    Michael   20.0         3     yes
6     g    Matthew   14.5         1     yes
7     h      Laura    NaN         1      no
8     i      Kevin    8.0         2      no
9     j      Jonas   19.0         1     yes

##### 39. Write a Pandas program to combining two series into a DataFrame.

In [54]:
s1 = pd.Series([np.random.randint(1, 10) for i in range(5)])
s2 = pd.Series([np.random.randint(1, 10) for i in range(5)])

# I used this method:
# series_df = pd.DataFrame([s1, s2]).transpose()

# This is the alternative showed on the site:
series_df = pd.concat([s1, s2], axis=1)

series_df

   0  1
0  5  6
1  8  7
2  8  8
3  3  4
4  8  9

##### 40. Write a Pandas program to shuffle a given DataFrame rows.

In [66]:
df_shuf = df.copy().sample(frac=1)
df_shuf

        name  score  attempts qualify
g    Matthew   14.5         1     yes
a  Anastasia   12.5         1     yes
h      Laura    NaN         1      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
b       Dima    9.0         3      no
f    Michael   20.0         3     yes
e      Emily    9.0         2      no
i      Kevin    8.0         2      no
d      James    NaN         3      no

##### 41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [132]:
s01 = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
s02 = pd.Series([np.random.randint(1, 10) for i in range(3)])

time_df = pd.DataFrame([s01, s02], index=['date', 'attendees']).T
time_df[time_df.columns[0]] = pd.to_datetime(time_df[time_df.columns[0]])
time_df

        date attendees
0 2000-03-11         9
1 2000-03-12         4
2 2000-03-13         7

##### 42. Write a Pandas program to rename a specific column name in a given DataFrame.

In [134]:
new = time_df.rename(columns={'attendees': 'students'})
new

        date students
0 2000-03-11        9
1 2000-03-12        4
2 2000-03-13        7

##### 43. Write a Pandas program to get a list of a specified column of a DataFrame.

In [137]:
names = df.copy()['name'].tolist()
print(names)

['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas']

##### 44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

In [173]:
col1 = np.array(np.zeros(5))
col2 = np.array(np.ones(5))
col3 = np.array(np.random.randint(1, 10, 5))

num_df = pd.DataFrame([col1, col2, col3], index=['zeroes', 'ones', 'random']).T
num_df

   zeroes  ones  random
0     0.0   1.0     3.0
1     0.0   1.0     6.0
2     0.0   1.0     7.0
3     0.0   1.0     8.0
4     0.0   1.0     4.0

##### 45. Write a Pandas program to find the row for where the value of a given column is maximum.

In [186]:
df_max = num_df['random'].max()
num_2 = num_df[num_df['random'] == df_max].index[0]

num_2

3